**Loads SQL extension**

In [2]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

**Creating connection to postgres database 'dvdrental'**

In [3]:
%sql postgresql://postgres:786420@localhost/dvdrental

### 1. Aggregate Functions

- **COUNT** (number of rows in a particular column)
- **SUM** (adds together all values in a particular column)
- **MIN** and **MAX** (returns lowest and highest values in a particular column)
- **AVG** (returns avg of a group of selected values)

**COUNT** *(with all columns using *) gives count of all the rows.

In [19]:
%%sql

SELECT COUNT(*) FROM address

 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.

[(603,)]

**COUNT** *(with individual column)* gives count of all the non null rows.

In [18]:
%%sql

SELECT COUNT(address2) FROM address

 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.

[(599,)]

***same as above just w/ changed column name of rows count***

In [20]:
%%sql

SELECT COUNT(address2) AS count_of_address2 FROM address

 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.

[(599,)]

**SUM** *(can only be applied on columns containing numerical values)*

In [26]:
%%sql

SELECT SUM(rental_rate) FROM film

 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.

[(Decimal('2980.00'),)]

**MIN and MAX**

In [29]:
%%sql

SELECT MIN(rental_rate) AS min_rental_rate,
  MAX(rental_rate) AS max_rental_rate
FROM film

 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.

[(Decimal('0.99'), Decimal('4.99'))]

**AVG** *(can only be applied on numerical columns & it ignores the nulls completely)*

In [32]:
%%sql

SELECT AVG(rental_rate) FROM film

 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.

[(Decimal('2.9800000000000000'),)]

***same as above as AVG ignores nulls by default***

In [33]:
%%sql

SELECT AVG(rental_rate) FROM film WHERE rental_rate IS NOT NULL

 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.

[(Decimal('2.9800000000000000'),)]

### 2. GROUP BY
**(Helps in seperating data into groups & aggregating them independently)**

In [41]:
%%sql

SELECT *
FROM payment 
LIMIT 10

 * postgresql://postgres:***@localhost/dvdrental
10 rows affected.

[(17503, 341, 2, 1520, Decimal('7.99'), datetime.datetime(2007, 2, 15, 22, 25, 46, 996577)),
 (17504, 341, 1, 1778, Decimal('1.99'), datetime.datetime(2007, 2, 16, 17, 23, 14, 996577)),
 (17505, 341, 1, 1849, Decimal('7.99'), datetime.datetime(2007, 2, 16, 22, 41, 45, 996577)),
 (17506, 341, 2, 2829, Decimal('2.99'), datetime.datetime(2007, 2, 19, 19, 39, 56, 996577)),
 (17507, 341, 2, 3130, Decimal('7.99'), datetime.datetime(2007, 2, 20, 17, 31, 48, 996577)),
 (17508, 341, 1, 3382, Decimal('5.99'), datetime.datetime(2007, 2, 21, 12, 33, 49, 996577)),
 (17509, 342, 2, 2190, Decimal('5.99'), datetime.datetime(2007, 2, 17, 23, 58, 17, 996577)),
 (17510, 342, 1, 2914, Decimal('5.99'), datetime.datetime(2007, 2, 20, 2, 11, 44, 996577)),
 (17511, 342, 1, 3081, Decimal('2.99'), datetime.datetime(2007, 2, 20, 13, 57, 39, 996577)),
 (17512, 343, 2, 1547, Decimal('4.99'), datetime.datetime(2007, 2, 16, 0, 10, 50, 996577))]

In [39]:
%%sql

SELECT staff_id,
    COUNT(*) AS count
FROM payment 
GROUP BY staff_id

 * postgresql://postgres:***@localhost/dvdrental
2 rows affected.

[(1, 7292), (2, 7304)]

**GROUP BY** *(with multiple columns)*

In [ ]:
%%sql

SELECT staff_id,

    COUNT(*) AS count
FROM payment 
GROUP BY staff_id